In [1]:
import pandas as pd

## Series

In [2]:
## Creating empty series
d=pd.Series()

In [3]:
d

Series([], dtype: object)

In [4]:
print(type(d))

<class 'pandas.core.series.Series'>

In [5]:
## Creating series with one element
d=pd.Series(17)

In [6]:
d

0    17
dtype: int64

In [7]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [8]:
d

0    10
1    11
2    12
dtype: int64

In [9]:
##  creating series using list
d=pd.Series([45,78,56,445,78])

In [11]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [12]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [13]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [14]:
s2 = pd.Series(arr2)

ValueError: Data must be 1-dimensional, got ndarray of shape (3, 2) instead

In [13]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [15]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [16]:
d.values()

dict_values([1, 2, 3, 4])

In [17]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [18]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3), ('d', 4)])

In [19]:
d['a']

1

In [20]:
b=pd.Series(d)

In [21]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
b[0]

1

In [22]:
b['a']

1

In [23]:
import numpy as np

In [24]:
s1=pd.Series(arr_2)
s1

NameError: name 'arr_2' is not defined

In [23]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d[:-8:2]

0     1
2     3
4    47
6     7
dtype: int64

In [24]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [25]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [27]:
d[4]=34  ## changing the element

In [28]:
d[[4,5,3,6]]

4    34
5    98
3     5
6     7
dtype: int64

In [29]:
d[6:10]=[100,200,300,400]

In [30]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [32]:
# import numpy as np
# import pandas as pd

In [26]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s

one      1
Two      2
Three    4
Four     6
dtype: int32

In [27]:
arr4=np.array([1,2,4,6])
s1=pd.Series(arr4)   
s1

0    1
1    2
2    4
3    6
dtype: int32

In [33]:
print(s)

one      1
Two      2
Three    4
Four     6
dtype: int32

## DataFrame

In [29]:
import pandas as pd
## empty dataframe
d=pd.DataFrame()

In [30]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [31]:
d

Empty DataFrame
Columns: []
Index: []

In [32]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
#import pandas as pd

In [33]:
data=[['abc',1],['def',2],['ghi',3],['','hij'],['klm','a']]

In [34]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['', 'hij'], ['klm', 'a']]

In [35]:
d1=pd.DataFrame(data)

In [36]:
d1

     0    1
0  abc    1
1  def    2
2  ghi    3
3       hij
4  klm    a

In [ ]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## chnaging the column

In [31]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [32]:
d

     A    B
A  abc    1
B  def    2
C  ghi    3
D       hij
E  klm    a

In [40]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [41]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [42]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [43]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [32]:
d.rename({'Candidate':'Candidate112','Age_years':'Age_years112'},axis=1,inplace=True)

In [33]:
d

  Candidate112  Age_years112
0            a            45
1            b            12
2            c            48
3            d            25
4            e            12
5            f            56

In [47]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [48]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [49]:
data[2][0]

'Kelly'

In [50]:
data[2][0]='asdf'

In [51]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['asdf', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [6]:
import pandas as pd

In [52]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [53]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [54]:
d[1,1]

KeyError: (1, 1)

In [55]:
d.Name

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [56]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2     asdf
3    Boris
4      Ken
Name: Name, dtype: object

In [57]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2   asdf      Eco
3  Boris      Geo
4    Ken  English

In [11]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [58]:
d.iloc[1,1]

12

In [13]:
#d[0,0]

In [14]:
d.iloc[0,0] ="ALEX"  # changing an element

In [15]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2   asdf   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [16]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2   asdf   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [17]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age  Subject Gender
0   ALEX    9    Maths   Male
1    Bob   11  Science   Male
2   asdf   14      Eco   Male
3  Boris   13      Geo   Male
4    Ken   17  English   Male

In [18]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2   asdf   14
3  Boris   13
4    Ken   17

In [19]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [20]:
d.iloc[1:3,[0,1]]

   Name  Age
1   Bob   11
2  asdf   14

In [21]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [ ]:
pwd

In [ ]:
d

In [ ]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

loc used for locating with column names

In [ ]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

In [ ]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [ ]:
d

In [ ]:
d.loc[:,1]

In [ ]:
# loc is typically used for accessing columns.

In [ ]:
d['Age']

In [ ]:
d.loc[:,'Age']

In [ ]:
d

In [ ]:
d.loc[3] ## getting the rows with singular index value

In [ ]:
d.iloc[:,[1,2]]

In [ ]:
d.iloc[:3,1:3]